{
  "education": [
    {
      "awards_achievements": [
        "Graduated with honours (2023)",
        "GPA: 3.7/4.0"
      ],
      "degree": "Diploma in Computer Programming",
      "department": "Faculty of Applied Science \u0026 Engineering Technology",
      "duration": "2019 - 2023",
      "school_name": "Seneca Polytechnic College"
    },
    {
      "awards_achievements": [
        "Graduated with distinction, achieving a cumulative grade of 92 percent."
      ],
      "degree": "Certificate in Software Engineering",
      "department": "Software Engineering Program",
      "duration": "2023",
      "school_name": "Brainstation"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng__VisaganShan/",
  "highlighted_projects": [
    {
      "description": "Conceptualized, strategized, and implemented a comprehensive full-stack application that allows users to find, manage, and create workouts that cater to users needs. Gym Junkie was made using the following tech stack: React and SASS for the front end website design and features, Node/Express for the backend API for interactions with the database, JWT for authentication of users, and Knex to query a MySQL database hosted on AWS.",
      "git_url": "https://github.com/VisaganS/gym_junkie_backend",
      "name": "Gym Junkie - Website"
    },
    {
      "description": "Designed and implemented a front-end application that showcases my skills and projects as a software devleoper. This application was made using React for function, SASS for styling, and animated using libraries such as AOS, react-parallax, slick carousel, etc.",
      "git_url": "https://www.visa-shan.com",
      "name": "Portfolio - Website"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a monitoring agent that can track the hardware specifications and resource usage of machines in a Linux cluster and store the data inside a database. The application retrieved hardware specifications and resource usage by running bash scripts that used regex to retrieve relevant values and stored them in a postgreSQL database which was instaniated using Docker. Operations would be set to repeat on an interval that was set using crontab and the application was using virtual machine instances.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_VisaganShan/tree/main/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "JDBC App: Established a stock market simulator that allows users to view, purchase, and sell stocks. Implemented using Java and operates by first retrieving a stock quote using the OkHttp library to retrieve values from the AlphaVantage Stock API, converting the retrieved JSON data into a Java object using Jackson library, and storing the object in a dockerized postgreSQL database which interacts with Data Access Layer (DAO objects) that was implemented to handle interactions between the application and the database. Service layer was implemented for business logic (stock quote lookup, buying \u0026 selling of a position) and interacts with the controller which provides a user interface allowing the user to interact with the application and perform service layer operations.",
        "Grep App: a command-line utility that searches for a text pattern recursively in a given directory, and outputs matched lines to a file. Implemented using Java and features such as Regex to retrieve pattern-matched text and Stream for efficient File reading and writing proccesses. Deployed using a fat JAR file and converted into a Docker Image for dockerized instance use."
      ],
      "git_url": "/core_java",
      "name": "Java Projects"
    },
    {
      "description": "Analyzed a company's transaction data and generated reports about their monthly revenue, and their new and existing users. Created an RFM (Recency, Frequency, Monetary) report about their customer base to determine which customers they should expedite more of their energy towards. All analyses were conducted using a Jupyter notebook, and Python was used along with libraries such as Pandas, Matplotlib, NumPy, and SQLAlchemy. Docker was used to run the Postgres container, which is the company's data warehouse.",
      "git_url": "/python_data_analytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "Set up clusters on Google Cloud Platform and Azure Databricks to manage and analyze large retail datasets. Leveraged Spark on both Zeppelin (GCP) and Databricks (Azure) to perform distributed data processing, enabling efficient large-scale analysis. Used Spark transformations and aggregations, such as calculating item totals, grouping by invoices, and filtering data based on custom criteria to identify patterns in sales data and calculate key metrics (growth rates, averages, etc).",
      "git_url": "/spark",
      "name": "Spark/ Scala"
    }
  ],
  "name": "Visa Shan",
  "others": [
    {
      "bullets": [
        "Intro to Cloud Computing (2024)",
        "Developing Front-End Apps With React (IBM, 2024)",
        "Developing Back-End Apps with Node.js Express (IBM, 2024)",
        "Developing AI Applications with Python and Flask (IBM, 2024)",
        "Python for Data Science, AI, and Development (IBM, 2024)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Fitness / Weight Lifting",
        "Car Repair and Modifications",
        "Self-Improvement Practices (Learning new skills, improving new skills, etc)"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Worked on various data projects involving Linux, Bash, Docker, Postgres, Java, and Spring Boot. Followed the scrum agile methodology implementing Git and Git Flow methodology with every project. Assisted others in project-related issues, and held daily scrum meetings as a scrum leader.",
      "duration": "2024-present",
      "title": "Software Developer"
    },
    {
      "company": "SuperProf",
      "description": "Provided one-on-one tutoring sessions to students to help them grasp complex programming concepts, troubleshoot programming errors and debug code. Languages and frameworks worked with include: HTML, CSS, Javascript, React, Python, Django, Flask, C++, and C.",
      "duration": "2023-present",
      "title": "Tutor"
    },
    {
      "company": "Wireless Wave / Glentel Inc.",
      "description": "Utilized excellent communication and teamwork skills to foster collaborative environments and achieve successful sales outcomes in the telecommunications industry. Demonstrated a strong work ethic, consistently exceeding monthly milestones and delivering results within designated timeframes.",
      "duration": "2022-2023",
      "title": "Sales \u0026 Communications"
    }
  ],
  "skills": {
    "competent": [
      "Cloud Platforms (AWS, GCP)",
      "Django",
      "Flask",
      "C++",
      "Lua"
    ],
    "familiar": [
      "C",
      "Typescript",
      "Visual Basic",
      "PHP",
      "Powershell"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git",
      "Python",
      "HTML \u0026 CSS",
      "Javascript",
      "React",
      "Express.js"
    ]
  },
  "summary": "I am a software developer who enjoys solving dynamic problems. Prior to working at Jarvis, I graduated from Seneca College in 2023 with a diploma in Computer Programming, and then I did a 4 month intensive bootcamp with BrainStation for software development. During this period of time I’ve built several applications using a variety of technologies such as React, Sass, Express.js, Flask, Django, and SQL. Currently at Jarvis, I’ve been working on an assortment of projects, the majority of which use Java and Linux technologies such as Bash, Docker, and Virtualization. In my spare time, I work as a freelance programming tutor, helping college and university students with their assignments and enhancing their coding skills."
}
