{
  "education": [
    {
      "awards_achievements": [
        "Graduated with honours (2023)",
        "GPA: 3.7/4.0"
      ],
      "degree": "Diploma in Computer Programming",
      "department": "N/A",
      "duration": "2019 - 2023",
      "school_name": "Seneca Polytechnic College"
    },
    {
      "awards_achievements": [
        "Graduated with distinction, achieving a cumulative grade of 92 percent."
      ],
      "degree": "Software Development Diploma",
      "department": "N/A",
      "duration": "2023",
      "school_name": "Brainstation"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng__VisaganShan/",
  "highlighted_projects": [
    {
      "description": "Conceptualized, strategized, and implemented a comprehensive full-stack application that allows users to find, manage, and create workouts that cater to users needs. Gym Junkie was made using the following tech stack: React and SASS for the front end and Node/Express backend API with JWT for auth, and Knex to query a MySQL database.",
      "git_url": "https://github.com/VisaganS/gym_junkie_backend",
      "name": "Gym Junkie - Website"
    },
    {
      "description": "Suspendisse a tincidunt odio. Suspendisse posuere luctus aliquet. Quisque magna tellus, tempor vitae arcu sed, volutpat scelerisque lacus. Aliquam varius pulvinar dapibus. Ut a tincidunt sem. Aenean sollicitudin fringilla erat ut imperdiet. Phasellus fermentum, enim vitae laoreet elementum, eros nisl hendrerit lorem.",
      "git_url": null,
      "name": "Machine Learning"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a monitoring agent that can track the hardware specifications and resource usage of machines in a Linux cluster and store the data inside a database. This monitoring agent is programming using technologies such as Bash, Docker, PostgreSQL, and Git and is tested using virtual machine instances running Rocky Linux 9 on the Google Cloud Platform(GCP).",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_VisaganShan/tree/main/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "JDBC App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "Grep App: a command-line utility that searches for a text pattern recursively in a given directory, and outputs matched lines to a file. Implemented using Core Java and its features such as Lambda, Stream and Regex and imported IO classes. Deployed using a fat JAR file, turned into a Docker Image and containizered the application."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Visa Shan",
  "others": [
    {
      "bullets": [
        "Intro to Cloud Computing (2024)",
        "Developing Front-End Apps With React (IBM, 2024)",
        "Developing Back-End Apps with Node.js Express (IBM, 2024)",
        "Developing AI Applications with Python and Flask (IBM, 2024)",
        "Python for Data Science, AI, and Development (IBM, 2024)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Fitness / Weight Lifting",
        "Car Repair and Modifications",
        "Self-Improvement"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Donec mattis sed justo et sagittis. Vestibulum lacinia nulla ipsum. Curabitur imperdiet nibh vitae leo lacinia laoreet. Nullam accumsan, lectus ut maximus ultricies, augue justo egestas mi, vel bibendum felis.",
      "duration": "2024-present",
      "title": "Software Developer"
    },
    {
      "company": "SuperProf",
      "description": "Provided one-on-one tutoring sessions to students to help them grasp complex programming concepts, troubleshoot programming errors and debug code. Languages and frameworks worked with include: HTML, CSS, Javascript, React, Python, Django, Flask, C++, and C.",
      "duration": "2023-present",
      "title": "Tutor"
    },
    {
      "company": "Wireless Wave / Glentel Inc.",
      "description": "Utilized excellent communication and teamwork skills to foster collaborative environments and achieve successful outcomes. Demonstrated a strong work ethic, consistently meeting project milestones and delivering results within designated timeframes.",
      "duration": "2022-2023",
      "title": "Sales \u0026 Communications"
    }
  ],
  "skills": {
    "competent": [
      "Cloud Platforms (AWS, GCP)",
      "Typescript",
      "C++",
      "Docker",
      "Bash/Shell"
    ],
    "familiar": [
      "C",
      "Lua",
      "Visual Basic",
      "PHP",
      "Powershell"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git",
      "Python",
      "HTML \u0026 CSS",
      "Javascript",
      "Front-end Frameworks (React)",
      "Back-end Frameworks (Express.js, Node.js)"
    ]
  },
  "summary": "I am a data engineer and I enjoy solving complex problems. My journey into the software industry began in high school when I decided to take a coding course and discovered that I love to be challenged mentally and apply my skills instead of learning through methods that focus on just retaining and regurgitating knowledge from books and documents. From there I pursued my passion and my education, graduating from Seneca College in 2023 in Computer Programming and a Software Development Bootcamp at Brainstation. In my spare time, I work as a freelance programming tutor, helping college and university students with their assignments."
}
